app/controllers/securities_controller.rb

  def index
    @portfolio = Portfolio.find(params[:portfolio_id])
    @securities = Security.where(portfolio_id: @portfolio.id)
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "securities".* FROM "securities" WHERE "securities"."portfolio_id" = $1  [["portfolio_id", 5]]

  def create
    puts params
    @portfolio = Portfolio.find(params[:portfolio_id])
    @security = Security.new(security_params)
    @security.portfolio = @portfolio

    if @security.save
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "securities" ("portfolio_id", "ticker", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["portfolio_id", 5], ["ticker", "AUX"], ["created_at", "2020-06-11 20:25:37.096967"], ["updated_at", "2020-06-11 20:25:37.096967"]]

  def set_security
    @security = Security.find(params[:id])
---
SELECT "securities".* FROM "securities" WHERE "securities"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]